<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <link rel="stylesheet" href="http://www3.di.uminho.pt/~jcr/bootstrap3/css/bootstrap.min.css">
      <link rel="stylesheet" href="http://www3.di.uminho.pt/~jcr/bootstrap3/css/bootstrap-theme.min.css"><script src="http://www3.di.uminho.pt/~jcr/bootstrap3/js/bootstrap.min.js"></script></head>
   <body>
      <div class="container">
         <center>
            <h1>Desenvolvimento de uma Ontologia</h1>
            <h2>Processamento e Representa&ccedil;&atilde;o de Conhecimento (2015)</h2>
            <h3>Historial:</h3>
            <center>
               										[2015-06-18 (criado)]<br></center>
            <p class="lead">
                           
               <p>Neste projecto pretende-se que os alunos desenvolvam uma ontologia para um dom&iacute;nio escolhido e definido pelos pr&oacute;prios.</p>
                           
               <p>A ontologia desenvolvida dever&aacute; obedecer aos requisitos que se apresentam a seguir.</p>
                       
            </p>
         </center>
         <hr width="75%">
         <h2><a name="indice"></a> &Iacute;ndice
         </h2>
         <ol compact>
            <li><a href="#d0e32">O Projeto</a><ol type="a"></ol>
            </li>
            <li><a href="#d0e67">Requisitos</a><ol type="a"></ol>
            </li>
            <li><a href="#d0e92">Extras</a><ol type="a"></ol>
            </li>
         </ol>
         <hr width="75%">
                 
         <div class="panel panel-default">
            <div class="panel-heading">
               <h2 class="panel-title"><a name="d0e32"></a>O Projeto
               </h2>
            </div>
            <div class="panel-body">
               <p>Uma ontologia &eacute; uma especifica&ccedil;&atilde;o formal de conhecimento inerente a um determinado dom&iacute;nio.</p>
               <p>Neste projeto, ter&aacute;s de desenvolver essa especifica&ccedil;&atilde;o de acordo com o que aprendeste nas aulas e com os requisitos que se
                  enumeram a seguir.
               </p>
               <p>Para o bom desenvolvimento do projeto aconselha-se o seguinte esquema de desenvolvimento:
                  <ul>
                                     
                     <li>Defini&ccedil;&atilde;o do dom&iacute;nio: clarificar muito bem qual o dom&iacute;nio da ontologia que se vai especificar, &eacute; impos&iacute;vel desenvolver uma
                        universal;
                     </li>
                                     
                     <li>Na sequ&ecirc;ncia do ponto anterior, definir a hierarquia de classes que carateriza o dom&iacute;nio definido;</li>
                                     
                     <li>Definir as propriedades que ser&atilde;o necess&aacute;rias para especificar o dom&iacute;nio de conhecimento escolhido: rela&ccedil;&otilde;es entre classes
                        e atributos associados aos indiv&iacute;duos de cada classe;
                     </li>
                                     
                     <li>Utilizar as propriedades definidas para especificar axiomas sobre o dom&iacute;nio: por exemplo, converter classes primitivas em
                        classes definidas;
                     </li>
                                     
                     <li>Selecionar/definir um dataset de indiv&iacute;duos para povoar as classes;</li>
                                     
                     <li>Depois de todos os pontos anteriores estarem planeados, usar o Prot&eacute;g&eacute; para fazer a especifica&ccedil;&atilde;o.</li>
                                 
                  </ul>
               </p>
            </div>
         </div>
                 
         <div class="panel panel-default">
            <div class="panel-heading">
               <h2 class="panel-title"><a name="d0e67"></a>Requisitos
               </h2>
            </div>
            <div class="panel-body">
               <p>
                  <ul>
                                     
                     <li>O dom&iacute;nio escolhido dever&aacute; ser suficientemente rico para demonstrar os pontos referidos acima;</li>
                                     
                     <li>Cada classe dever&aacute; estar povoada com no m&iacute;nimo 20 indiv&iacute;duos, a n&atilde;o ser que n&atilde;o fa&ccedil;a sentido (aqui podem faz&ecirc;-lo &agrave; m&atilde;o ou
                        com scripts, se usarem scripts n&atilde;o se limitem aos 20 indiv&iacute;duos carreguem os datasets de que disp&ocirc;em);
                     </li>
                                     
                     <li>Quando processada por um reasoner a ontologia n&atilde;o dever&aacute; apresentar incongru&ecirc;ncias (inst&acirc;ncias na classe <tt>Nothing</tt>);
                     </li>
                                     
                     <li>O trabalho final a apresentar ser&aacute; constitu&iacute;do por relat&oacute;rio descrevendo os v&aacute;rios passos desenvolvidos onde dever&aacute; constar
                        a ontologia em anexo, e um ficheiro &agrave; parte com a ontologia em formato RDF/XML ou OWL/XML.
                     </li>
                                 
                  </ul>
               </p>
            </div>
         </div>  
                 
         <div class="panel panel-default">
            <div class="panel-heading">
               <h2 class="panel-title"><a name="d0e92"></a>Extras
               </h2>
            </div>
            <div class="panel-body">
               <p>Qualquer componente desenvolvido que n&atilde;o esteja pedido neste enunciado ser&aacute; considerado um extra. Eis alguns exemplos:
                  <ul>
                                     
                     <li>Queries em SPARQL para exemplificar v&aacute;rias coisas que se podem extrair da ontologia;</li>
                                     
                     <li>Site HTML para navegar na ontologia;</li>
                                     
                     <li>etc...</li>
                                 
                  </ul>
               </p>
            </div>
         </div>
             
      </div>
   </body>
</html>